<?php

namespace PersonnelBundle\Entity;

/**
 *
 */
class Property
{
    const EXEMPLARY = 'Exemplary';
    const GOOD = 'Good';
    const SATISFACTORY = 'Satisfactory';
    const UNSATISFACTORY = 'Unsatisfactory';

    const CLERICAL = 'Clerical';
    const GD = 'GD';
    const COOK = 'Cook';
    const MT = 'MT';
    const MEDICAL_ASSISTANT = 'Medical Assistant';

    const TRADE_CHOICES = [
        'ক্লার্ক' => 'ক্লার্ক',
        'জিডি' => 'জিডি',
        'পাঁচক ইউ' => 'পাঁচক ইউ',
        'পাঁচক মেস' => 'পাঁচক মেস',
        'টেইলার' => 'টেইলার',
        'কার্পেন্টার' => 'কার্পেন্টার',
        'এমটি ' => 'এমটি ',
        'ইএন্ডবি আর ' => 'ইএন্ডবি আর ',
        'ড্রাইভার  এ আর ভি ' => 'ড্রাইভার  এ আর ভি ',
        'ডিএমটি' => 'ডিএমটি',
        'ফিডার  ' => 'ফিডার  ',
        'ওসিইউ ' => 'ওসিইউ ',
        'ওপিআর' => 'ওপিআর',
        'টিএ' => 'টিএ',
        'ফিটার' => 'ফিটার',
        'গানার' => 'গানার',
        'ইএন্ডবিআর' => 'ইএন্ডবিআর',
        'এই' => 'এই',
        'ওইপি' => 'ওইপি',
        'ডিএসভি' => 'ডিএসভি',
        'মেশন' => 'মেশন',
        'সার্ভেয়ার' => 'সার্ভেয়ার',
        'ড্রাফটসম্যান' => 'ড্রাফটসম্যান',
        'মেরিন ড্রাইভার' => 'মেরিন ড্রাইভার',
        'পেইন্টার' => 'পেইন্টার',
        'এসএমএস' => 'এসএমএস',
        'এসএমটি' => 'এসএমটি',
        'মেডিক্যাল এসিস্টেন্ট' => 'মেডিক্যাল এসিস্টেন্ট',
        'ওটি' => 'ওটি',
        'ল্যাব' => 'ল্যাব',
        'ফিজিও' => 'ফিজিও',
        'রেডিও' => 'রেডিও',
        'পিএমএ' => 'পিএমএ',
        'এসটিএ' => 'এসটিএ',
        'আইসিএ' => 'আইসিএ',
        'স্টেনো' => 'স্টেনো',
        'টিএভি' => 'টিএভি',
        'টিবিভি' => 'টিবিভি',
        'টিসিভি' => 'টিসিভি',
        'আর্মোরার' => 'আর্মোরার',
        'ওয়েল্ডার' => 'ওয়েল্ডার',
    ];

    const LIVING_NATURE = [
        'ভাড়া বাড়ী' => 'ভাড়া বাড়ী',
        'মাটির ঘর' => 'মাটির ঘর',
        'টিনের ঘর' => 'টিনের ঘর',
        'হাফ বিল্ডিং' => 'হাফ বিল্ডিং',
        'ফ্লাট' => 'ফ্লাট',
    ];

    const INCOME_SOURCE = [
        'চাকুরী' => 'চাকুরী',
        'ব্যাবসা' => 'ব্যাবসা',
        'চাষাবাদ' => 'চাষাবাদ',
    ];
}